ErpTest/src/InformationRegisters/пкФормированиеДоставки/пкФормированиеДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкФормированиеДоставки</name>
  <resources>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерХодки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТочкаМаршрута</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/уатЭкипажТС/уатЭкипажТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатЭкипажТС</name>
  <comment>(уат)</comment>
  <resources>
    <name>ЧленЭкипажа</name>
    <type>
      <types>EnumRef.уатЧленыЭкипажа</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТС</name>
    <comment>Транспортное средство</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/пкВидыОперацийЗаданийНаПеревозку/пкВидыОперацийЗаданийНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкВидыОперацийЗаданийНаПеревозку</name>
  <enumValues>
    <name>ДоставкаКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>Перекат</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМеждуРегионами</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/уатЧленыЭкипажа/уатЧленыЭкипажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатЧленыЭкипажа</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>ОсновнойВодитель</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСопроводительноеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ВторойВодитель</name>
  </enumValues>
  <enumValues>
    <name>ВтороеСопроводительноеЛицо</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/пкЗаданиеНаПеревозку/пкЗаданиеНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкЗаданиеНаПеревозку</name>
  <basedOn>Catalog.ОбъектыЭксплуатации</basedOn>
  <basedOn>Document.пкЗаданиеНаПеревозку</basedOn>
  <registerRecords>InformationRegister.пкСтатусыТехники</registerRecords>
  <registerRecords>InformationRegister.пкСрокиАренды</registerRecords>
  <registerRecords>InformationRegister.пкРезервТехники</registerRecords>
  <registerRecords>AccumulationRegister.пкМоделиКДоставкеПоЗаявкамНаАрендуТехники</registerRecords>
  <registerRecords>AccumulationRegister.пкТехникаКПеремещениюМеждуРегионами</registerRecords>
  <registerRecords>InformationRegister.пкДатыАренды</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.пкВидыОперацийЗаданийНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегионПолучатель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный за доставку</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусыЗаданийНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаТехники</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАренды</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗаказНарядНаОсмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаПодтверждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеПодтверждения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоПодтвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КПроверке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвержденоКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийВодителю</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Повреждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Повреждения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ErpTest/src/Documents/пкАктПриемкиВозврата/пкАктПриемкиВозврата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкАктПриемкиВозврата</name>
  <comment>Акты приемки/возврата техники</comment>
  <posting>Deny</posting>
  <attributes>
    <name>ПриемкаВозврат</name>
    <type>
      <types>EnumRef.пкПриемкаВозврат</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>DocumentRef.пкДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерХодки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный за доставку</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>пкПрикрепленыФайлыВДО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаданияНаПеревозку</name>
    <attributes>
      <name>ЗаданиеНаПеревозку</name>
      <type>
        <types>DocumentRef.пкЗаданиеНаПеревозку</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаАрендуТехники</name>
      <type>
        <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
      </type>
    </attributes>
    <attributes>
      <name>Транспортировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьАренды</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/InformationRegisters/пкФормированиеДоставки/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////////////

//Добавить тЗаданиеНаПеревозку в доставку по параметрам, указанным в ПараметрыДоставки
// ПараметрыДоставки:
//	- ДатаДоставки
//	- Подразделение
//	- Транспорт
//	- Водитель
//	- Перевозчик
//	- НомерХодки
//  , ТочкаМаршрутаОпределяется по данным параметрам доставки(или в уже имеющаяся, или новая точка)
Функция ДобавитьЗаданиеНаПеревозкуВДоставку(тЗаданиеНаПеревозку, ПараметрыДоставки, ИскатьДляСвязанных = Истина, ТочкаМаршрута = 0) Экспорт
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(тЗаданиеНаПеревозку) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыДоставки.ДатаДоставки) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыДоставки.Подразделение) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыДоставки.Транспорт) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат Отказ;
	КонецЕсли;
	
	ЗапросМаршрут = Новый Запрос;
	ЗапросМаршрут.Текст =
	"ВЫБРАТЬ
	|	пкФормированиеДоставки.ЗаданиеНаПеревозку,
	|	пкФормированиеДоставки.ТочкаМаршрута КАК ТочкаМаршрута,
	|	пкФормированиеДоставки.Водитель,
	|	пкФормированиеДоставки.Перевозчик
	|ИЗ
	|	РегистрСведений.пкФормированиеДоставки КАК пкФормированиеДоставки
	|ГДЕ
	|	пкФормированиеДоставки.ДатаДоставки = &ДатаДоставки
	|	И пкФормированиеДоставки.Подразделение = &Подразделение
	|	И пкФормированиеДоставки.Транспорт = &Транспорт
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТочкаМаршрута";
	ЗапросМаршрут.УстановитьПараметр("ДатаДоставки", ПараметрыДоставки.ДатаДоставки);
	ЗапросМаршрут.УстановитьПараметр("Подразделение", ПараметрыДоставки.Подразделение);
	ЗапросМаршрут.УстановитьПараметр("Транспорт", ПараметрыДоставки.Транспорт);
	
	Маршрут = ЗапросМаршрут.Выполнить().Выгрузить();
	
	//1. Проверить возможность добавления по Способу доставки
	//ДоступныйСпособДоставки = Истина;
	//Для Каждого текТочка Из Маршрут Цикл
	//	ДоступныйСпособДоставки = (ДоступныйСпособДоставки И текТочка.ЗаданиеНаПеревозку.СпособДоставки = тЗаданиеНаПеревозку.СпособДоставки);
	//КонецЦикла;
	//
	//Если Не ДоступныйСпособДоставки Тогда
	//	
	//	тСообщение = Новый СообщениеПользователю;
	//	тСообщение.Текст = НСтр("ru='Невозможно добавить задание с другим способом доставки в уже существующий маршрут.'");
	//	тСообщение.Сообщить();
	//	
	//	Отказ = Истина;
	//	Возврат Отказ;
	//	
	//КонецЕсли;
	
	//2. Для переката-погрузки добавляем выезд
	Если ИскатьДляСвязанных Тогда
		Если тЗаданиеНаПеревозку.ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.Перекат Тогда
			Если ЗначениеЗаполнено(тЗаданиеНаПеревозку.ЗаданиеНаПеревозку) Тогда //Получатель - помещаем родителя в Маршрут
				Отказ = ДобавитьЗаданиеНаПеревозкуВДоставку(тЗаданиеНаПеревозку.ЗаданиеНаПеревозку, ПараметрыДоставки, Истина);
				Возврат Отказ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//3. Нужно определить точку маршрута по транспорту в этот день и адресу в задании на перевозку
	ПоследняяТочка	= 0;
	
	Водитель		= ПараметрыДоставки.Водитель;
	Перевозчик		= ПараметрыДоставки.Перевозчик;
	
	Для Каждого текТочка Из Маршрут Цикл
		
		Водитель	= текТочка.Водитель;
		Перевозчик	= текТочка.Перевозчик;
		
		Если Лев(тЗаданиеНаПеревозку.АдресДоставки, 1000) = Лев(текТочка.ЗаданиеНаПеревозку.АдресДоставки, 1000) Тогда
			Если ТочкаМаршрута <= текТочка.ТочкаМаршрута Тогда
				ТочкаМаршрута = текТочка.ТочкаМаршрута;
			Иначе
				
//Раррус Владимир Подрещов 09.10.2017 5963
//Закомментируем проверку, в принципе может быть могоступенчатый перекат туда-обратно-туда...
//				тСообщение = Новый СообщениеПользователю;
//				тСообщение.Текст = НСтр("ru='Невозможно добавить Перекат: адрес разгрузки раньше адреса погрузки!.'");
//				тСообщение.Сообщить();
//				
//				Отказ = Истина;
//				Возврат Отказ;
//Раррус Владимир Подрещов Конец
				
			КонецЕсли;
			Прервать;
		КонецЕсли;
		
		ПоследняяТочка = текТочка.ТочкаМаршрута;
		
	КонецЦикла;
	
	//ОПРЕДЕЛЯЕМ ТОЧКУ
	ТочкаМаршрута = Макс(ТочкаМаршрута, ПоследняяТочка + 1);
	
	//4. Проверим Акт на предмет свободности
	тАкт = АктПоЗаданию(тЗаданиеНаПеревозку);
	Если ЗначениеЗаполнено(тАкт) И ЗначениеЗаполнено(тАкт.Доставка) Тогда
		
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = НСтр("ru='Выбранное задание уже в не свободном Акте по доставке:'") + тАкт.Доставка;
		тСообщение.Сообщить();
		
		Отказ = Истина;
		Возврат Отказ;
		
	КонецЕсли;

	//5. Обработаем связанные: 
	//		- Для переката надо найти связанные вторые стороны и сдвинуть с ними
	//		- Соседние в свободном Акте сдвинуть с ними
	Если ИскатьДляСвязанных Тогда
		Если тЗаданиеНаПеревозку.ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.Перекат Тогда
			Если НЕ ЗначениеЗаполнено(тЗаданиеНаПеревозку.ЗаданиеНаПеревозку) Тогда //Отправитель
				
				//Ищем все подчиненные и тоже помещаем в маршрут
				ЗапросКонецПереката = Новый Запрос;
				ЗапросКонецПереката.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	пкЗаданиеНаПеревозку.Ссылка КАК ЗаданиеНаПеревозку
				|ИЗ
				|	Документ.пкЗаданиеНаПеревозку КАК пкЗаданиеНаПеревозку
				|ГДЕ
				|	НЕ пкЗаданиеНаПеревозку.ПометкаУдаления
				|	И пкЗаданиеНаПеревозку.Проведен
				|	И пкЗаданиеНаПеревозку.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку";
				ЗапросКонецПереката.УстановитьПараметр("ЗаданиеНаПеревозку", тЗаданиеНаПеревозку);
				ТекущиеЗаданияНаПеревозку = ЗапросКонецПереката.Выполнить().Выгрузить();
				Для Каждого текСтрока Из ТекущиеЗаданияНаПеревозку Цикл
					Отказ = Отказ ИЛИ ДобавитьЗаданиеНаПеревозкуВДоставку(текСтрока.ЗаданиеНаПеревозку, ПараметрыДоставки, Ложь, ТочкаМаршрута + 1);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(тАкт) Тогда
			Для Каждого текСтрока Из тАкт.ЗаданияНаПеревозку Цикл
				Если текСтрока.ЗаданиеНаПеревозку = тЗаданиеНаПеревозку Тогда
					Продолжить;
				КонецЕсли;
				Отказ = Отказ ИЛИ ДобавитьЗаданиеНаПеревозкуВДоставку(текСтрока.ЗаданиеНаПеревозку, ПараметрыДоставки, Ложь, ТочкаМаршрута);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	//6. Все в порядке можно записывать
	Если Не Отказ Тогда
		//...дозаполним водителя/перевозчика если вдруг они не указаны
		Если (Не ЗначениеЗаполнено(Водитель))
			И(Не ЗначениеЗаполнено(Перевозчик))
		Тогда
		
			ЗапросВодитель = Новый Запрос;
			ЗапросВодитель.Текст = 
			"ВЫБРАТЬ
			|	уатЭкипажТС.Сотрудник
			|ИЗ
			|	РегистрСведений.уатЭкипажТС КАК уатЭкипажТС
			|ГДЕ
			|	уатЭкипажТС.ТС = &ТС
			|	И уатЭкипажТС.ЧленЭкипажа = &ЧленЭкипажа";
			ЗапросВодитель.УстановитьПараметр("ТС", ПараметрыДоставки.Транспорт);
			ЗапросВодитель.УстановитьПараметр("ЧленЭкипажа", Перечисления.уатЧленыЭкипажа.ОсновнойВодитель);
			РезЗапроса = ЗапросВодитель.Выполнить().Выбрать();
			Если РезЗапроса.Следующий() Тогда
				Водитель = РезЗапроса.Сотрудник.ФизическоеЛицо;
			КонецЕсли;
			
		КонецЕсли;
		
		ПараметрыДоставки.Водитель					= Водитель;
		ПараметрыДоставки.Перевозчик				= Перевозчик;
		ПараметрыДоставки.Вставить("ТочкаМаршрута", ТочкаМаршрута);
		ЗаписатьПараметрыДляЗадания(тЗаданиеНаПеревозку, ПараметрыДоставки);
		
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

//Удаляем тЗаданиеНаПеревозку из буфера формирования доставки:
// - когда сформировали документ пкДоставка
// - пользователь удалил доставку интерактивно в обработке Управление логистикой
Процедура ИсключитьЗаданиеИзДоставки(тЗаданиеНаПеревозку, ИскатьДляСвязанных = Истина) Экспорт
	
	Если Не ЗначениеЗаполнено(тЗаданиеНаПеревозку) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.пкФормированиеДоставки.СоздатьНаборЗаписей();
	НаборЗаписей.Записывать = Истина;
	
	НаборЗаписей.Отбор.ЗаданиеНаПеревозку.Установить(тЗаданиеНаПеревозку, Истина);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = ОписаниеОшибки();
		тСообщение.Сообщить();
	КонецПопытки;
	
	Если ИскатьДляСвязанных Тогда
		Если тЗаданиеНаПеревозку.ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.Перекат Тогда
			Если НЕ ЗначениеЗаполнено(тЗаданиеНаПеревозку.ЗаданиеНаПеревозку) Тогда //Отправитель
				
				//Ищем все подчиненные и тоже помещаем в маршрут
				ЗапросКонецПереката = Новый Запрос;
				ЗапросКонецПереката.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	пкЗаданиеНаПеревозку.Ссылка КАК ЗаданиеНаПеревозку
				|ИЗ
				|	Документ.пкЗаданиеНаПеревозку КАК пкЗаданиеНаПеревозку
				|ГДЕ
				|	НЕ пкЗаданиеНаПеревозку.ПометкаУдаления
				|	И пкЗаданиеНаПеревозку.Проведен
				|	И пкЗаданиеНаПеревозку.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку";
				ЗапросКонецПереката.УстановитьПараметр("ЗаданиеНаПеревозку", тЗаданиеНаПеревозку);
				ТекущиеЗаданияНаПеревозку = ЗапросКонецПереката.Выполнить().Выгрузить();
				Для Каждого текСтрока Из ТекущиеЗаданияНаПеревозку Цикл
					ИсключитьЗаданиеИзДоставки(текСтрока.ЗаданиеНаПеревозку, Ложь);
				КонецЦикла;
				
			Иначе //Получатель - помещаем родителя в Маршрут
				ИсключитьЗаданиеИзДоставки(тЗаданиеНаПеревозку.ЗаданиеНаПеревозку, Ложь);
			КонецЕсли;
		КонецЕсли;
		
		тАкт = АктПоЗаданию(тЗаданиеНаПеревозку);
		Если ЗначениеЗаполнено(тАкт) Тогда
			Для Каждого текСтрока Из тАкт.ЗаданияНаПеревозку Цикл
				Если текСтрока.ЗаданиеНаПеревозку = тЗаданиеНаПеревозку Тогда
					Продолжить;
				КонецЕсли;
				ИсключитьЗаданиеИзДоставки(текСтрока.ЗаданиеНаПеревозку, Ложь);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//Записать параметры доставки для тЗаданиеНаПеревозку:
// ПараметрыДоставки:
//	- ДатаДоставки
//	- Подразделение
//	- Транспорт
//	- Водитель
//	- Перевозчик
//  - ТочкаМаршрута
Процедура ЗаписатьПараметрыДляЗадания(тЗаданиеНаПеревозку, ПараметрыДоставки) Экспорт
	
	Если Не ЗначениеЗаполнено(тЗаданиеНаПеревозку) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыДоставки.ДатаДоставки) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыДоставки.Подразделение) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыДоставки.Транспорт) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.пкФормированиеДоставки.СоздатьНаборЗаписей();
	НаборЗаписей.Записывать = Истина;
	
	НаборЗаписей.Отбор.ЗаданиеНаПеревозку.Установить(тЗаданиеНаПеревозку, Истина);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	НоваяЗаись = НаборЗаписей.Добавить();
	НоваяЗаись.ЗаданиеНаПеревозку	= тЗаданиеНаПеревозку;
	НоваяЗаись.ДатаДоставки			= ПараметрыДоставки.ДатаДоставки;
	НоваяЗаись.Подразделение		= ПараметрыДоставки.Подразделение;
	НоваяЗаись.Транспорт			= ПараметрыДоставки.Транспорт;
	НоваяЗаись.Водитель				= ПараметрыДоставки.Водитель;
	НоваяЗаись.Перевозчик			= ПараметрыДоставки.Перевозчик;
	НоваяЗаись.НомерХодки			= ПараметрыДоставки.НомерХодки;
	НоваяЗаись.ТочкаМаршрута		= ПараметрыДоставки.ТочкаМаршрута;
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = ОписаниеОшибки();
		тСообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

Функция АктПоЗаданию(тЗаданиеНаПеревозку)
	
	Если Не ЗначениеЗаполнено(тЗаданиеНаПеревозку) Тогда
		Возврат Документы.пкАктПриемкиВозврата.ПустаяСсылка();
	КонецЕсли;
	
	ЗапросАкты = Новый Запрос;
	ЗапросАкты.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	пкАктПриемкиВозвратаЗаданияНаПеревозку.Ссылка
	|ИЗ
	|	Документ.пкАктПриемкиВозврата.ЗаданияНаПеревозку КАК пкАктПриемкиВозвратаЗаданияНаПеревозку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.пкАктПриемкиВозврата КАК пкАктПриемкиВозврата
	|		ПО пкАктПриемкиВозвратаЗаданияНаПеревозку.Ссылка = пкАктПриемкиВозврата.Ссылка
	|ГДЕ
	|	пкАктПриемкиВозвратаЗаданияНаПеревозку.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку";
	ЗапросАкты.УстановитьПараметр("ЗаданиеНаПеревозку", тЗаданиеНаПеревозку);
	РезЗапроса = ЗапросАкты.Выполнить().Выбрать();
	
	Если РезЗапроса.Следующий() Тогда
		Возврат РезЗапроса.Ссылка;
	Иначе
		Возврат Документы.пкАктПриемкиВозврата.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
